auto_dealership/app/controllers/locations_controller.rb

  def index
    redirect_to '/users' and return unless session[:current_position]
    if session[:current_position] != '1'
      redirect_to '/users'
    end
    @locations = Location.all
---
SELECT `locations`.* FROM `locations`