auto_dealership/app/controllers/positions_controller.rb

  def index
    redirect_to '/users' and return unless session[:current_position]
    @positions = Position.all
---
SELECT `positions`.* FROM `positions`