auto_dealership/app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
SELECT `positions`.* FROM `positions`
---
  def index
    @users = User.all
    @positions = Position.all

SELECT `positions`.* FROM `positions`  ORDER BY name
---
  def new
    @user = User.new
    @positions = Position.all

SELECT `positions`.* FROM `positions`  ORDER BY name
---
  def edit
    @positions = Position.all