auto_dealership/app/controllers/vehicles_controller.rb

  def index
    redirect_to '/users' and return unless session[:current_position]
    @vehicles = Vehicle.all
    @locations = Location.all
    @users = User.all
---
SELECT `vehicles`.* FROM `vehicles`
SELECT `locations`.* FROM `locations`
SELECT `users`.* FROM `users`

  def show
    @locations = Location.all
---
SELECT `locations`.* FROM `locations`

  def edit
    @locations = Location.all
---
SELECT `locations`.* FROM `locations`  ORDER BY name

  def update
    respond_to do |format|
      if @vehicle.update(vehicle_params)
---
UPDATE `vehicles` SET `available` = 0, `sold_price` = '123', `user_id` = 2, `updated_at` = '2016-08-22 08:29:58' WHERE `vehicles`.`id` = 2

    def set_vehicle
      @vehicle = Vehicle.find(params[:id])
---
SELECT  `vehicles`.* FROM `vehicles` WHERE `vehicles`.`id` = NULL LIMIT 1